ANNOUNCE_STRINGS = {
    -- 这些不是特定于字符的字符串，而是用于缓解翻译。
    -- 注意！在开始和结尾的空格都是重要的，应该保留。
    _ = {
        getArticle = function(name)
            -- 如果名称以元音字母开头，则使用“an”，否则就使用“a” ——中文用不到，但有很多量词，愿有朝一日能做到区分开，而不全是“个”。
            return "1 个"
        end,
        -- 如果项目有多个(复数)，词后加{S} ——中文用不到
        -- 即使在英语中，这也不是完美的，但它已经足够接近了
        S = "个",
        STAT_NAMES = {
            Hunger = "饥饿",
            Sanity = "精神",
            Health = "生命",
            ["Log Meter"] = "野兽变身",
            Wetness = "雨露",
            Abigail = "姐妹",
            Flex = "肌肉",
            Battle = "战歌",
            Boat = "战舰",
            Stamina = "体力",
            -- 其他mod统计数据不会有翻译，但至少我们可以支持这些

            -- 你的想法很好，我可以帮你做到  -- 呼吸
            Spellpower = "魔力",
            Electric = "电量",
            Bloom = "养分",
        },
        ANNOUNCE_ITEM = {
            -- 这需要反映翻译语言的语法
            -- 例如，这可能变成“我的箱子装有6个纸莎草。”
            FORMAT_STRING = "{I_HAVE}{THIS_MANY} {S}{ITEM}{IN_THIS}{CONTAINER}{WITH}{PERCENT}{DURABILITY}。",

            -- 其中一个进入了{I_HAVE}
            I_HAVE = "我拥有 ",
            WE_HAVE = "我们拥有着 ",

            -- {THIS_MANY}是一个数字如有多个，但是单数会因语言而异
            -- 所以我们用getArticle来得到它

            -- {ITEM}是从item.name获得的

            -- {S} uses S above

            -- 进入{IN_THIS}，如果存在
            IN_THIS = " 在这个 ",

            -- {CONTAINER}是从 container.name 中获取的

            -- 其中一个进入{WITH}
            WITH = " 它有 ", -- 如果只是一个事物
            AND_THIS_ONE_HAS = ", 这个有着 ", -- 如果有多个，只显示一个的耐久性
            AND_THIS_ONE_IS = ", 这个是",

            -- {PERCENT} 是否从产品的耐用性中获得

            -- 进入 {DURABILITY}
            DURABILITY = " 的耐久度",
            FRESHNESS = " 新鲜度",

            HEATROCK = {"冷冰冰的", "清凉的", "圆滚滚的", "热乎的", "滚烫的"}
        },
        ANNOUNCE_RECIPE = {
            -- 这需要反映翻译语言的语法
            -- 这是一个例子:
            -- "我有一台预制的科学机器，准备就绪" -> 已制作且未放置
            -- "我将做一把斧头。" -> 已知，且有足够原材料
            -- "有人能给我做个炼金术引擎吗？我需要一台科学机器。" -> 未知
            -- "我们需要更多的干燥架。" -> 已知，但没有足够原材料
            FORMAT_STRING = "{START_Q}{TO_DO}{THIS_MANY}{S} {ITEM} {PRE_BUILT}{END_Q}{I_NEED}{A_PROTO}{PROTOTYPER}{FOR_IT}。",

            -- {START_Q} 是为那些匹配的语言吗？ 在两端
            START_Q = "", -- 英语不这么做

            -- 其中一个进入 {TO_DO}
            I_HAVE = "我做好了 ", -- 对预构建
            ILL_MAKE = "我可以帮你制作 ", -- 对于已知的配方，你有原料
            CAN_SOMEONE = "有人可以帮我做 ", -- 对未知的配方
            WE_NEED = "我需要制造 1 ", -- 对于已知的配方，你没有原料

            -- {THIS_MANY} 使用getArticle来获得正确的文章 ("a", "an")

            -- {ITEM} 来自 recipe.name

            -- {S} uses S above

            -- 进入 {PRE_BUILT}
            PRE_BUILT = " 准备放置",

            -- 此进入 {END_Q} 如果它是一个问题
            END_Q = "吗？",

            -- 进入 {I_NEED}
            I_NEED = " 我还差 ",

            -- {PROTOTYPER} 来自 recipepopup.teaser:GetString 利用这函数 
            getPrototyper = function(teaser)
                -- 这是句子的精华 "Use a (science machine) to..." 和 "Use an (alchemy engine) to..."
                return teaser:gmatch("<.*>")() or teaser:gmatch("需要(.*)来")()
            end,

            -- 进入 {FOR_IT}
            FOR_IT = " 才能制造它"
        },
        ANNOUNCE_INGREDIENTS = {
            -- 这就需要反映翻译语言的语法
            -- 这样做的例子:
            -- "我还需要两块石头和一台科学机器来制造炼金术引擎。"
            FORMAT_NEED = "请给我 {NUM_ING} {S}{INGREDIENT}{AND}{A_PROTO}{PROTOTYPER} 来制造 {RECIPE}。", -- 这个绝对不改！底线！ 

            -- If a prototyper is needed, goes into {AND}
            AND = " 和 ",

            -- 这就需要反映翻译语言的语法
            -- 这样做的例子:
            -- "我有足够的树枝做9个捕鸟器，但我需要一个科学机器。"
            FORMAT_HAVE = "我有足够的{INGREDIENT}来制造 {A_REC}{REC_S}{RECIPE}{BUT_NEED}{A_PROTO}{PROTOTYPER}。",
            ---{A_REC}
            -- 如果需要原型，则进入{BUT_NEED}
            BUT_NEED = ", 我还需要 "
        },
        ANNOUNCE_SKIN = {
            -- 这就需要反映翻译语言的语法
            -- 例如，这可能会变成"我有悲惨的火炬皮肤"
            FORMAT_STRING = "我拥有 {ITEM} 的『{SKIN}』皮肤。",
            -- 没皮肤的
            NO_SKIN = "需要我制造一个 {ITEM} 吗？",

            -- 交给我吧
            NO_PROBLEM = "交给我来做 {ITEM} 吧！"

            -- {SKIN} 来自皮肤的名字

            -- {ITEM} 来自物品的名称
        },
        ANNOUNCE_TEMPERATURE = {
            -- 这就需要反映翻译语言的语法
            -- 例如，这可能会变成"我处于一个舒适的温度"
            -- 或者“野兽是冰冷的！”
            FORMAT_STRING = "{PRONOUN} {TEMPERATURE}",

            -- {PRONOUN} 是从这里挑选出来的
            PRONOUN = {
                DEFAULT = "我 ",
                BEAST = "这个怪物是 " -- 对于 Werebeaver
            },

            -- {TEMPERATURE} 是从这里挑选出来的
            TEMPERATURE = {
                BURNING = "过热了！",
                HOT = "几乎过热！",
                WARM = "有点热。",
                GOOD = "在一个舒适的温度。",
                COOL = "稍微有点冷。",
                COLD = "几乎冻结！",
                FREEZING = " “凝固”了！"
            }
        },
        ANNOUNCE_WORLDTEMP = {

            FORMAT_STRING = "{PRONOUN} {TEMPERATURE}",

            PRONOUN = {
                DEFAULT = "我 ",
                BEAST = "这个怪物是 ", -- 对于 Werebeaver
                WORLD = "这个气候 " -- 世界温度宣告-Shang
            },

            -- 世界温度宣告-Shang
            WORLDTEMP = {
                BURNING = "空调已经停止工作了！",
                HOT = "需要稍微开开空调吧！",
                WARM = "可能需要几台电风扇！",
                GOOD = "很适合安逸生活嬉戏玩耍！",
                COOL = "可以生个火堆！",
                COLD = "需要生个大火堆！",
                FREEZING = "世界已经冰天雪地了！"
            }
        },
        ANNOUNCE_SEASON = "{SEASON}天还有{DAYS_LEFT}天就结束了。",
        ANNOUNCE_GIFT = {
            CAN_OPEN = "许愿！许愿！许愿！！！",
            NEED_SCIENCE = "我要开红了！"
        },
        ANNOUNCE_HINT = "宣告",

        -- 饥荒更新内容 by 呼吸
        -- 此内容不要删改，请在别的mod设置STRINGS._STATUS_ANNOUNCEMENTS._
        -- 该模组未获得授权，请勿收录到其他合集
        ANNONCE_pin_open = "需要我做什么吗？",
        ANNONCE_COUNT = {
            ONE = "{NAME} 在我这里。",
            MORE = "我这里有 {COUNT} 个 {NAME}。"
        },
        ANNOUNCE_COOLDOWN = {
            INCONTAINER = "{I_HAVE}{THIS_MANY}{S} {ITEM} {IN_THIS}{CONTAINER}{AND_THIS_ONE_HAS}{COOLDOWN}{TIMESTRING}。",
            AND_THIS_ONE_HAS = ", 这个",
            COOLDOWN_OK = "已经就绪",
            COOLDOWN_PRE = "即将刷新",
            COOLDOWN_WAIT = "将会在 ",
            I_HAVE = "我的",
            END = " 后刷新"
        },
        ANNOUNCE_MOON = {
            TODAY = "今晚",
            TOMORROW = "明晚",
            AFTER = "我们刚度过",
            FULLMOON = "月圆",
            NEWMOON = "新月",
            INTERVAL = "，",
            FORMAT_STRING = "{RECENT}{PHASE1}{INTERVAL}距离下个 {PHASE2} 还有{MOONLEFT}天。",
            FORMAT_FULLMOON = "{RECENT}{PHASE1}{INTERVAL}记得拿格罗姆~",
            FORMAT_NEWMOON = "{RECENT}{PHASE1}{INTERVAL}月黑风高夜，记得做火把~"
        },
        ANNOUNCE_PING = {
            BEST = "无延迟,纵享丝滑",
            A = "(低延迟:{PING}) 风驰电掣, 势在必得！",
            B = "(普通延迟:{PING}) 我时刻准备着。",
            C = "(高延迟:{PING}) 高Ping战士, 请求摸鱼~",
            D = "(超高延迟:{PING}) 我延迟好高, 的反是都字打"
        },
        ANNOUNCE_SAYHI = {
            greeting = {"你好吗，{NAME} ?", "{NAME}，需要我帮忙吗？", "你好！{NAME}！",
                        "{NAME}, 你需要什么吗？", "我来帮你了，{NAME}！",
                        "{NAME} 应该是个友善的玩家！你好！", "你好，我的朋友{NAME}"},
            ghost_he = {"可怜的{NAME}, 有什么能够拯救你？", "{NAME}, 我会救你的！", "{NAME}为自己的粗心付出了代价。", "小可怜虫, {NAME}"},
            ghost_me = {"{NAME}, 你可以拯救我吗？", "我是个幽灵, {NAME}, 你能满足我复活的愿望吗?", "复活就拜托你了！ 亲爱的{NAME}！"},
            ghost_we = {"{NAME}, 我们都是幽灵！", "我和{NAME}都死了, 哈哈！", "要一起去找试金石吗？{NAME}"},
        },

        -- 奇怪的宣告，只能用替换的方式，不然会和角色台词冲突！
        ANNOUNCE_SUBFMT = {
            MIAO = {
                res = {{"我们拥有着", "主人有"}, {"距离下个", "和主人在一起的下个"},
                       {"我们刚度过", "刚度过"}, {"在一个舒适的温度", "好舒服好舒服"},
                       {"过热了！", "热 好热  人家要融化了"}, {"几乎过热！", "好热 呜喵~ 好热"},
                       {"有点热。", "热 好热 "}, {"稍微有点冷。", "冷冰冰"},
                       {"几乎冻结！", "呜呜~ 好冷~ 冷喵"},
                       {" “凝固”了！", "好冷好冷 呜呜 好冷好冷"}, {"我", "人家"}, {"人家蹭", "我蹭"}, {"人家们", "我们"}},
                suffix = "喵~",
                suffix_emoji = "heart",
                -- 烧0 塔什干酱
                sayhi = {
                     greeting = {"{NAME}~我蹭我蹭，嘿嘿，和亲爱的在一起真开心", "如果我是宫殿里的公主的话……亲爱的{NAME}一定会骑着白马来接我的，对吧对吧！",
                     "被我迷到目不转睛了吗，{NAME}？嗯嗯，喜欢就多看看", "{NAME}，亲爱的，我们快出发吧！"},
                     ghost_he = {"可怜的{NAME}, 有什么能够拯救你？", "{NAME}, 我会救你的！", "{NAME}为自己的粗心付出了代价。", "小可怜虫, {NAME}"},
                     ghost_me = {"{NAME}, 你可以拯救我吗？", "我是个幽灵, {NAME}, 你能满足我复活的愿望吗?", "复活就拜托你了！ 亲爱的{NAME}！"},
                     ghost_we = {"{NAME}, 我们都是幽灵！", "我和{NAME}都死了, 哈哈！", "要一起去找试金石吗？{NAME}"},
                 },
            },
            BOSS = {
                res = {{"距离下个", "朕夜观星象, 发现下个"},
                       {"需要我做什么吗？", "朕要微服私访了！"},
                       {"我可以帮你制作", "朕可以赏你"}, {"我们刚度过", "朕的天下刚度过"},
                       {"我们拥有着", "国库里有"}, {"我这里", "朕的江山上"},
                       {"请给我", "来人, 朕需要"}, {"我", "朕"}}
            },
            NIE = {
                res = {{"我", "咱"}, {"许愿！许愿！许愿！！！", "少女折寿中..."},
                       {"我要开红了！", "少女祈祷中..."},
                       {"无延迟,纵享丝滑", "无延迟,纵享丝滑捏"}, {"。", "捏。"}, {"！", "捏！"},
                       {"~", "捏~"},
                       {"(超高延迟:{PING}) 我延迟好高, 的反是都字打",
                        "(超高延迟:{PING}) 我裂开来捏！"}, {"吧！", "捏！"}, {"……", "捏……"},
                       {"！？", "捏！？"}, {"*", "捏*"}}
            }
        }
    },
    -- 下面是一切 character-specific
    UNKNOWN = {
        HUNGER = {
            FULL = "高于75%…我完全饱了！", -- >75%
            HIGH = "55%…我可以吃一点！", -- >55%
            MID = "35%…我肚子饿瘪了！", -- >35%
            LOW = "15%…我非常饿！", -- >15%
            EMPTY = "低于15%…我马上要饿扑街了！" -- <15%
        },
        SANITY = {
            FULL = "高于75%…我的大脑在巅峰状态！", -- >75%
            HIGH = "55%…我感觉还不错！", -- >55%
            MID = "35%…我有点焦虑！", -- >35%
            LOW = "15%…我感觉，这里有点疯狂！", -- >15%
            EMPTY = "低于15%…啊哒，好疼！暗影恶魔在追我！" -- <15%
        },
        HEALTH = {
            FULL = "100%…我去，血槽满了！", -- 100%
            HIGH = "75%…我挂了一些彩！", -- >75%
            MID = "50%…我靠，严重挂彩！", -- >50%
            LOW = "25%…血肉模糊，我已写好遗书！", -- >25%
            EMPTY = "低于25%…看管好我的财产！" -- <25%
        },
        WETNESS = {
            FULL = "高于75%…完全湿身！", -- >75%
            HIGH = "55%…我湿透了，哇！背包好隔水，把我装进去吧！", -- >55%
            MID = "35%…我很湿！我去，背包也湿了！", -- >35%
            LOW = "15%…我只湿了一小块，还不足为惧！", -- >15%
            EMPTY = "我有一点点潮湿……" -- <15%
        }
    },
    WILSON = {
        HUNGER = {
            FULL = "我填满了肚子！",
            HIGH = "我还不缺乏吃的。",
            MID = "我可以去吃一点儿。",
            LOW = "我真的饿了！",
            EMPTY = "我……需要……食物……"
        },
        SANITY = {
            FULL = "视理智为还可以。",
            HIGH = "我会好起来的。",
            MID = "我的头很痛……",
            LOW = "Wha——那些行走的是什么！？",
            EMPTY = "需要帮助！这些东西将要吃掉我！！"
        },
        HEALTH = {
            FULL = "健康的如一把小提琴！",
            HIGH = "我受伤了，但我可以继续行动。",
            MID = "我……我想我需要注意治疗。",
            LOW = "我失去了很多血……",
            EMPTY = "我……我将不能走完路程……"
        },
        WETNESS = {
            FULL = "我已经达到了饱和点！",
            HIGH = "水快滚出去！",
            MID = "我的衣服几乎渗透。",
            LOW = "Oh， H2O。",
            EMPTY = "我比较干燥。"
        }
    },
    WILLOW = {
        HUNGER = {
            FULL = "如果我不停止吃会发胖的。",
            HIGH = "愉快又饱满的。",
            MID = "我的生命之火需要一点燃料。",
            LOW = "Ugh，我要饿死在这里了！",
            EMPTY = "我现在已经饿的几乎皮包骨！"
        },
        SANITY = {
            FULL = "我认为我现在有充足的精神烧火。",
            HIGH = "我刚才看到伯尼在行走了么？……没有，不用介意。",
            MID = "我感觉寒冷无比，我很可能……",
            LOW = "伯尼，为什么我觉得如此寒冷！？",
            EMPTY = "伯尼，保护我不受那些可怕的事物咬伤！"
        },
        HEALTH = {
            FULL = "完美的我就应该没有一块伤痕！",
            HIGH = "我有一两处擦伤。我或许应该点燃它们。",
            MID = "这些裂口使我不再燃烧，我需要个医生……",
            LOW = "我觉得虚弱……我可能会……熄灭。",
            EMPTY = "我的生命之火几乎要熄灭……"
        },
        WETNESS = {
            FULL = "Ugh，这雨是最——坏——的！",
            HIGH = "我讨厌这一切水！",
            MID = "这场雨太多了。",
            LOW = "Uh oh，如果这场雨持续上升……",
            EMPTY = "没有足够的雨水能灭了火。"
        }
    },
    WOLFGANG = {
        HUNGER = {
            FULL = "沃尔夫冈是充实而强大的！",
            HIGH = "沃尔夫冈必须吃饱，才能变得更加强大！！",
            MID = "沃尔夫冈需要吃很多。",
            LOW = "沃尔夫冈的肚子饿的开洞了。",
            EMPTY = "沃尔夫冈现在急需要食物！！！"
        },
        SANITY = {
            FULL = "沃尔夫冈的头感觉良好！",
            HIGH = "沃尔夫冈的头感觉很有趣。",
            MID = "沃尔夫冈的头很疼",
            LOW = "沃尔夫冈看到可怕的怪物……",
            EMPTY = "到处都是可怕的怪物！！"
        },
        HEALTH = {
            FULL = "沃尔夫冈现在不需要修理！",
            HIGH = "沃尔夫冈需要点小修理",
            MID = "沃尔夫冈受伤了。",
            LOW = "沃尔夫冈需要很多的绷带来治疗伤口。",
            EMPTY = "沃尔夫冈或许要死了……"
        },
        WETNESS = {
            FULL = "沃尔夫冈现在可能是水做的！",
            HIGH = "这就像坐在池塘里……",
            MID = "沃尔夫冈不喜欢洗澡。",
            LOW = "雨水时代。",
            EMPTY = "沃尔夫冈是干燥的。"
        },
        FLEX = {
            FULL = "我要打十个！",
            HIGH = "来两个深蹲。",
            MID = "请问要办健身卡吗？",
            LOW = "我马上就要脂肪肝了。",
            EMPTY = "躺平了。"
        }
    },
    WX78 = {
        HUNGER = {
            FULL = "  燃料 状态：最大容量",
            HIGH = "  燃料 状态：高的 ",
            MID = "  燃料 状态：合意的 ",
            LOW = "  燃料 状态：低的 ",
            EMPTY = "  燃料 状态：危险的 "
        },
        SANITY = {
            FULL = "  CPU 状态：全面运转",
            HIGH = "  CPU 状态：功能的",
            MID = "  CPU 状态：破损的",
            LOW = "  CPU 状态：故障迫近",
            EMPTY = "  CPU 状态：多重故障检测"
        },
        HEALTH = {
            FULL = "  底盘 状态：理想状况",
            HIGH = "  底盘 状态：裂纹检测",
            MID = "  底盘 状态：中度损坏",
            LOW = "  底盘 状态：完全性损坏",
            EMPTY = "  底盘 状态：无功能的"
        },
        WETNESS = {
            FULL = "  受潮 状况：已达临界值",
            HIGH = "  受潮 状况：接近临界值",
            MID = "  受潮 状况：无法接受的",
            LOW = "  受潮 状况：可容许的",
            EMPTY = "  受潮 状况：合意的"
        },
        ELECTRIC = {
			FULL = "满载",
			HIGH = "安全",
			MID = "功能损耗",
			LOW = "低负荷",
			EMPTY = "燃尽",
        }
    },
    WICKERBOTTOM = {
        HUNGER = {
            FULL = "我应该从事研究工作，而不是填充自己。",
            HIGH = "充斥的，但不是臃肿的。",
            MID = "我感觉到有一点饥饿。",
            LOW = "这个图书管理员需要食物，我是担心害怕的！",
            EMPTY = "如果我不马上进食，就将会饿死！"
        },
        SANITY = {
            FULL = "在这里没有什么行为是非理智的。",
            HIGH = "我相信我有一点令人头痛之事。",
            MID = "这些偏头痛是难以忍受的。",
            LOW = "我不确定哪些事物是虚构的，再也不！",
            EMPTY = "帮帮我！这些深不可测又令人可憎的敌人！"
        },
        HEALTH = {
            FULL = "我的健康可以预计我的年龄！",
            HIGH = "受一些擦伤，但是无关紧要。",
            MID = "我的医疗需要装配。",
            LOW = "如果不治疗，这将是我的结局。",
            EMPTY = "我需要立刻马上就医！"
        },
        WETNESS = {
            FULL = "完全绝对浸湿！",
            HIGH = "我是湿的，湿的，湿的！重要的事情说三遍！",
            MID = "我想知道我的最高承受力是……",
            LOW = "水膜开始形成了 。",
            EMPTY = "我的水分是足够缺乏的。"
        }
    },
    WES = {
        HUNGER = {
            FULL = "*拍拍肚子*",
            HIGH = "*拍拍肚子*",
            MID = "*手张开嘴*",
            LOW = "*手张开嘴，眼睛瞪得大大的*",
            EMPTY = "*紧抓凹陷的胃绝望的一个眼神*"
        },
        SANITY = {
            FULL = "*行礼*",
            HIGH = "*翘起姆指*",
            MID = "*按摩太阳穴*",
            LOW = "*扫视四处疯狂似地*",
            EMPTY = "*摇篮一样的头，来回摇摆*"
        },
        HEALTH = {
            FULL = "*手结成心*",
            HIGH = "*触摸脉搏，竖起大拇指*",
            MID = "*手在手臂来回移动，示意包扎它*",
            LOW = "*摇晃手臂*",
            EMPTY = "*大幅摇摆，然后摔倒了*"
        },
        WETNESS = {
            FULL = "*疯狂地向上游泳*",
            HIGH = "*向上游泳*",
            MID = "*悲惨地看向天空*",
            LOW = "*保护头部武装起来*",
            EMPTY = "*微笑，拿着无形的保护伞*"
        }
    },
    WAXWELL = {
        HUNGER = {
            FULL = "我已经吃了完美的盛宴。",
            HIGH = "我很满足，但是不要过量。",
            MID = "吃个快餐可能很合适。",
            LOW = "我的内心已经空了。",
            EMPTY = "不！我没有挣到我得到自由将在饿死在这里！"
        },
        SANITY = {
            FULL = "衣冠楚楚的可以。",
            HIGH = "我通常坚定的智慧似乎是……摇摆不定。",
            MID = "Ugh，我头好痛。",
            LOW = "我需要明确我的头脑，我开始看到……它们。",
            EMPTY = "Help！这些阴影是真正的野兽，你要知道！"
        },
        HEALTH = {
            FULL = "我完全安然无恙。",
            HIGH = "它只是一个擦伤。",
            MID = "我可能需要给自己打个补丁。",
            LOW = "这不是我的天鹅之歌，但是我已经接近。",
            EMPTY = "不！我没有逃避而死在这里！"
        },
        WETNESS = {
            FULL = "湿润的好比水本身。",
            HIGH = "我不认为我会再次干燥。",
            MID = "这水会毁了我的西装。",
            LOW = "潮湿使我变得不整洁。",
            EMPTY = "干燥而整洁的。"
        }
    },
    WEBBER = {
        HUNGER = {
            FULL = "我们两者的胃部都爆满了。",
            HIGH = "我们可以再多啃一点。",
            MID = "我们认为是时候吃午饭了！",
            LOW = "我们此时会吃妈妈的剩菜……",
            EMPTY = "我们的胃是空的！"
        },
        SANITY = {
            FULL = "我们感觉健康又精力充沛。",
            HIGH = "小睡一会可以回复一下。",
            MID = "我们的头好痛……",
            LOW = "我们上一次有午睡吗？！",
            EMPTY = "我们不害怕你，可怕的东西！"
        },
        HEALTH = {
            FULL = "我们甚至没有划痕一丝！",
            HIGH = "我们需要一个创可贴。",
            MID = "我们需要再贴一个创可贴……",
            LOW = "我们的身体剧痛……",
            EMPTY = "我们还不想死……"
        },
        WETNESS = {
            FULL = "哇哈，我们湿透了！",
            HIGH = "我们的毛皮被浸泡了！",
            MID = "我们很湿！",
            LOW = "我们湿润地不讨人喜欢。",
            EMPTY = "我们喜欢在坑里玩耍。"
        }
    },
    WINONA = {
        HUNGER = {
            FULL = "我今天吃了一顿正餐。",
            HIGH = "我的胃总是有地方放存放更多食物！",
            MID = "我的午餐休息时间还没到吗？",
            LOW = "我快没油了，老板。",
            EMPTY = "如果再不给点东西吃，工厂就没有了工人！"
        },
        SANITY = {
            FULL = "我会永远保持理智。",
            HIGH = "全部还好但低于我的头巾！",
            MID = "我想我的螺丝松了……",
            LOW = "我的心碎了，我应该把它修好。",
            EMPTY = "这是一场噩梦！哈！但它很真实。"
        },
        HEALTH = {
            FULL = "我健康的犹如一匹汗血宝马！",
            HIGH = "嗯，我来解决它。",
            MID = "我仍然不能放弃。",
            LOW = "我可以领取工人的退休金吗…？",
            EMPTY = "我想我的轮班已经结束了……"
        },
        WETNESS = {
            FULL = "我不能在这种湿度下工作！",
            HIGH = "我的工作服正在吸收水份！",
            MID = "有人应该放下一个湿地板标志。",
            LOW = "在工作的时候补充水分是总是好的。",
            EMPTY = "这里没有什么。"
        }
    },
    WARLY = {
        HUNGER = {
            FULL = "我的烹饪将会是我的死亡！",
            HIGH = "我想现在我已经受够了。",
            MID = "是时候在沙漠里吃晚餐了。",
            LOW = "我错过了晚饭时间！",
            EMPTY = "饥饿……是最难受的死亡方式！"
        },
        SANITY = {
            FULL = "我做菜的香味让我神智清醒。",
            HIGH = "我觉得有点头晕。",
            MID = "我的脑筋不能转弯了。",
            LOW = "窃窃私语……救命啊！",
            EMPTY = "我再也受不了这种精神错乱了！"
        },
        HEALTH = {
            FULL = "我非常健康。",
            HIGH = "在切洋葱时我很糟糕。",
            MID = "我流血了……",
            LOW = "我可以用一些援助！",
            EMPTY = "我猜这就是我的结局了，挚友们……"
        },
        WETNESS = {
            FULL = "我能感觉到鱼在我的衬衫里游泳。",
            HIGH = "水会毁了我完美的菜肴！",
            MID = "在我感冒之前，我应该把衣服烘干。",
            LOW = "现在不是洗澡的时间或地点。",
            EMPTY = "只有几滴在我身上，没有坏处。"
        }
    },
    WALANI = {
        HUNGER = {
            FULL = "嗯，那是在天堂做的一顿饭。",
            HIGH = "我还可以去吃点小吃。",
            MID = "食物，食物，食物，重要的事情说三遍！",
            LOW = "这样我可能会得胃炎！",
            EMPTY = "请……我什么都可以吃！"
        },
        SANITY = {
            FULL = "没有比冲浪更能让我保持清醒的了。",
            HIGH = "海浪在呼唤我。",
            MID = "我的头有点晕。",
            LOW = "啊~ 我需要我的冲浪板！",
            EMPTY = "那些是什么……东西！？"
        },
        HEALTH = {
            FULL = "从未有如此美好的感觉！",
            HIGH = "只有几处刮痕，没什么大惊小怪的。",
            MID = "我可以用一些治疗药膏！",
            LOW = "感觉就像我的内脏已经放弃了我。",
            EMPTY = "我身上的每根骨头都碎了！"
        },
        WETNESS = {
            FULL = "我是彻底湿透了！",
            HIGH = "我的衣服好像很湿。",
            MID = "我可能需要一条毛巾。",
            LOW = "这一点点水不会使任何人受伤。",
            EMPTY = "我看到一场暴风雨即将来临！"
        }
    },
    WOODLEGS = {
        HUNGER = {
            FULL = "Yarr，那是一顿美餐，拉迪！",
            HIGH = "我肚子很饱了。",
            MID = "这是我每天吃饭的时间。",
            LOW = "啊！你们这些饭桶，让我吃什么呢！？",
            EMPTY = "我要饿死了！"
        },
        SANITY = {
            FULL = "是的，大海，她是个漂亮的女人！",
            HIGH = "是时候在海上旅行了！",
            MID = "我想念我的大海……",
            LOW = "记不起上次我去航海是什么时候了。",
            EMPTY = "我是一个挥舞弯刀的海盗船长，不是陆地上的傻大个！"
        },
        HEALTH = {
            FULL = "Yarr，我是个难对付的家伙！",
            HIGH = "这就是你们所得到的吗？",
            MID = "我还没有放弃！",
            LOW = "伍德莱格不是懦夫！",
            EMPTY = "Arr！你赢了，无赖！"
        },
        WETNESS = {
            FULL = "我浑身湿透了！",
            HIGH = "我喜欢我的水留在我的船上。",
            MID = "我的海盗衬衫被水打了。",
            LOW = "我裤子湿透了！",
            EMPTY = "Arr！正在酝酿一场暴风雨。"
        }
    },
    WILBUR = {
        HUNGER = {
            FULL = "*跳来跳去拍他的手*",
            HIGH = "*高兴地拍手*",
            MID = "*揉肚子*",
            LOW = "*悲伤的眼神和揉皱的肚皮*",
            EMPTY = "OOAOE! *按摩赫利*"
        },
        SANITY = {
            FULL = "*敲敲头部*",
            HIGH = "*竖起大拇指*",
            MID = "*看起来害怕*",
            LOW = "*尖叫令人难以忘怀*",
            EMPTY = "OOAOE! OOOAH!"
        },
        HEALTH = {
            FULL = "*用两只手来做箱子*",
            HIGH = "*猛击箱子*",
            MID = "*温柔地按摩缺失的补丁的皮毛*",
            LOW = "*艰难地惨*",
            EMPTY = "OAOOE! OOOOAE!"
        },
        WETNESS = {
            FULL = "*打喷嚏*",
            HIGH = "*按摩手臂在一起*",
            MID = "Ooo! Ooae!",
            LOW = "Oooh?",
            EMPTY = "Ooae Oooh Oaoa! Ooooe."
        }
    },
    WURT = {
        HUNGER = {
            FULL = "格鲁，我不要了。",
            HIGH = "我不饿。",
            MID = "我还能吃得下一些。",
            LOW = "我很需要食物！",
            EMPTY = "我真的很饿很饿！"
        },
        SANITY = {
            FULL = "好开心！",
            HIGH = "精神很好。",
            MID = "格鲁, 我的头部受伤了。",
            LOW = "可怕的黑影要过来了！",
            EMPTY = "格鲁, 可怕的噩梦怪物！！"
        },
        HEALTH = {
            FULL = "我很健康!",
            HIGH = "我感觉很好!",
            MID = "我需要帮助，我的鳞片掉了一些……",
            LOW = "呜咽，疼得厉害……",
            EMPTY = "救……命……啊！！！"
        },
        WETNESS = {
            FULL = "啊哈哈，水花溅呀溅！！",
            HIGH = "我的鳞片很舒服！",
            MID = "美人鱼 喜欢水!",
            LOW = "啊哈……有点水更好!",
            EMPTY = "太干燥了, 格鲁."
        }
    },
    WORTOX = {
        HUNGER = {
            FULL = "就不应该吃这么饱，肚子撑的要命！",
            HIGH = "“魂”足饭饱，去恶作剧吧！Hyuyu!",
            MID = "需要少量的灵... 如此致命。",
            LOW = "我想要一个美味的灵魂！恶作剧暂且延后！",
            EMPTY = "我对灵魂的渴望越来越贪婪！"
        },
        SANITY = {
            FULL = "头脑清醒...欢乐时光即将到来！Hyuyu!",
            HIGH = "我能吸点灵魂来保持我头脑清醒吗?",
            MID = "害！刚太跳了，现在有点头痛...",
            LOW = "我好羡慕这些影子的戏法! Hyuyu!",
            EMPTY = "我的思想处于一个纯粹疯狂的新境界!"
        },
        HEALTH = {
            FULL = "我现在状态绝佳，可以尽情捣蛋！",
            HIGH = "只是擦伤，一个灵魂就可以把它修复！",
            MID = "我需要一些灵魂来抚平这些伤口... Hyuyu!",
            LOW = "我自己的灵魂开始变得脆弱...",
            EMPTY = "我的灵魂将不再属于我! Hyuyu..."
        },
        WETNESS = {
            FULL = "我完全湿透了!",
            HIGH = "我就是这条街最潮湿的恶魔!",
            MID = "不久的将来这会有一只湿漉漉的恶魔！",
            LOW = "世界正赐予我一场淋浴!",
            EMPTY = "如果我想保持干燥的话，我应该都留意一下天气！"
        }
    },

    
    -- 台词修改 by 小谢 & 呼吸 & 个人彩蛋
    WATHGRITHR = {
        HUNGER = {
            FULL = "岂曰没饱，吃我一矛！",
            HIGH = "连呼吸都在渴望战斗。",
            MID = "猩红腐败的味道诱惑着我...",
            LOW = "我渴望一场盛宴！",
            EMPTY = "饿死也不吃素！",
        },
        SANITY = {
            FULL = "扫破天际，点落星辰！",
            HIGH = "世界都是我的舞台。",
            MID = "此刻正是 审判之时。",
            LOW = "长矛失去了光泽，灵魂陷入腐败...",
            EMPTY = "诸神黄昏, 诸神黄昏！"
        },
        HEALTH = {
            FULL = "现在是女武神时间！",
            HIGH = "绝不退让！",
            MID = "再次拿起了武器，为了我的伙伴。",
            LOW = "我可以被毁灭，但绝不会被打败！",
            EMPTY = "我的人生演出迎来了小谢幕……"
        },
        WETNESS = {
            FULL = "我完全湿透了！",
            HIGH = "一个战士在这雨天无法战斗！",
            MID = "我的护甲会生锈！",
            LOW = "让暴风雨来的更猛烈些吧。",
            EMPTY = "干澡够了继续战斗！"
        },
        BATTLE = {
            FULL = "我, WIGFRID，绝对的信仰!",
            HIGH = "愚蠢的对手！",
            MID = "众神指引着我，屈服吧!",
            LOW = "雅典娜为我祝福！",
            EMPTY = "让激战为我开嗓吧！"
        },
    },


    -- 本命角色 by 呼吸
    WANDA = {
        HUNGER = {
            FULL = "旺达吃饱，开始养老。",
            HIGH = "饭后百步走，旺达活到九十九",
            MID = "我要遵循科学的饮食时间。",
            LOW = "恰饭时间！",
            EMPTY = "急需补充饥饿的时间！"
        },
        SANITY = {
            FULL = "时间是真理的挚友。",
            HIGH = "时间和理智还算充裕.",
            MID = "穿越时间使我头痛...",
            LOW = "在时间中寻找理智？",
            EMPTY = "理智在浪费我的时间！"
        },
        HEALTH = {
            FULL = "时间就是生命！",
            HIGH = "劝君莫惜金缕衣，劝君惜取少年时。",
            MID = "花有重开时，人无再少年。",
            LOW = "君不见高堂明镜悲白发, 朝如青丝暮成雪！",
            EMPTY = "逝者如斯夫！"
        },
        WETNESS = {
            FULL = "时间如暴雨骤至, 肆虐仓夷！",
            HIGH = "时间如大雨倾盆, 势不可挡！",
            MID = "时间如大雨倾盆, 势不可挡！",
            LOW = "时间如小雨苏苏, 滋润万物。",
            EMPTY = "时间如小雨苏苏, 滋润万物。"
        }
    },
    WENDY = {
        HUNGER = {
            FULL = "我和姐姐美玉无瑕。",
            HIGH = "姐姐，你要吃些零食吗？",
            MID = "这吃食儿是我一人的，还是别的姐姐都有？",
            LOW = "吃不饱饥荒风雨黄昏后，忘不了新愁与旧愁。",
            EMPTY = "姐姐，我不能陪着你了！"
        },
        SANITY = {
            FULL = "气质美如兰，才华馥比仙。",
            HIGH = "温蒂如今也是冰雪聪明的。",
            MID = "心较比干多一窍，病如西子胜三分。",
            LOW = "姐姐，你看到它们了吗？快和我逃离这里！",
            EMPTY = "姐姐大人，对不起！"
        },
        HEALTH = {
            FULL = "天降大任托红颜，柔肩敢担，姐妹连环。",
            HIGH = "我是个多愁多病的身，姐姐是倾国倾城的貌。",
            MID = "态生两靥之愁，娇袭一身之病。",
            LOW = "花谢花飞飞满天，红消香断有谁怜？",
            EMPTY = "天尽头，何处有芳丘？"
        },
        WETNESS = {
            FULL = "想眼中有多少泪珠儿，怎经得秋流到冬尽，春流到夏！",
            HIGH = "这是雨水······还有我的眼泪。",
            MID = "温蒂和姐姐都湿透了！",
            LOW = "水灵灵的温蒂。",
            EMPTY = "这是姐姐的眼泪吗？"
        },
        ABIGAIL = {
            FULL = "天降大任托红颜，柔肩敢担，姐妹连环。",
            HIGH = "我是个多愁多病的身，姐姐是倾国倾城的貌。",
            MID = "态生两靥之愁，娇袭一身之病。",
            LOW = "花谢花飞飞满天，红消香断有谁怜？",
            EMPTY = "天尽头，何处有芳丘？"
        }
    },
    WOODIE = {
        HUMAN = { -- 人类形态
            HUNGER = {
                FULL = "全部都满了！",
                HIGH = "对于砍树仍然足够。",
                MID = "能力需要一个小吃！",
                LOW = "正餐铃响了！ ",
                EMPTY = "伍迪在挨饿！"
            },
            SANITY = {
                FULL = "伍迪可以演奏小提琴曲！",
                HIGH = "伍迪精力充足, 需要伍迪工作吗?",
                MID = "伍迪希望午睡后再工作。",
                LOW = "伍迪莫得精神, 伍迪无法工作",
                EMPTY = "所有恐惧都是真实的，还有伤害！"
            },
            HEALTH = {
                FULL = "啦啦啦, 我是砍树的小当家~",
                HIGH = "大难不死，必有后福。",
                MID = "可以和使用一些物品来变得健康",
                LOW = "这是痛苦真正的开始……",
                EMPTY = "真的.无法再..战斗了..."
            },
            WETNESS = {
                FULL = "这鬼天气导致我不能砍树。",
                HIGH = "因为这些雨水让格子花呢不再保暖。",
                MID = "我获得了相当的水分。",
                LOW = "格子花呢很温暖，也很潮湿。",
                EMPTY = "对我几乎不受影响。"
            },
            ["LOG METER"] = {
                FULL = "一直有更多的木头，但不是在我的肚子里。",
                HIGH = "我渴望有一个小树枝。",
                MID = "木头看起来真的很好吃。",
                LOW = "我能感觉到诅咒即将来临。",
                EMPTY = "一般这个宣告不可能出现，除非没有成功变身" -- (this shouldn't be possible, he'll become a werebeaver)
            }
        },
        WEREBEAVER = {
            -- HUNGER = { -- werebeaver 没有饥饿值
            -- FULL  = "",
            -- HIGH  = "",
            -- MID   = "",
            -- LOW   = "",
            -- EMPTY = "",
            -- },
            SANITY = {
                FULL = "吼哈！我是精力旺盛的大怪兽！",
                HIGH = "呀呼！怪兽要开始战斗了！",
                MID = "野兽有些累, 只有一半的精力。",
                LOW = "伍迪努力工作, 但影怪欺负伍迪。",
                EMPTY = "帮帮孩子, 救救伍迪！"
            },
            HEALTH = {
                FULL = "吃我巨鹿铁拳！",
                HIGH = "吃我巨鹿冲撞！",
                MID = "野兽在舔自己的伤口。",
                LOW = "呜吼~ 野兽流了好多血~",
                EMPTY = "呜呜呜~ 野兽偷偷逃跑了~"
            },
            WETNESS = {
                FULL = "野兽的皮毛完全湿透了。",
                HIGH = "野兽留下一串小水坑。",
                MID = "野兽的毛皮有点湿。",
                LOW = "野兽头上一点水滴。",
                EMPTY = "野兽的毛皮是干燥的。"
            },
            ["LOG METER"] = {
                FULL = "吼吼吼, 伍迪变身了, 快来帮伍迪捡木头。", -- > 90%
                HIGH = "吼吼吼, 看看海狸的大板牙！", -- > 70%
                MID = "吼哈哈, 一地的木头快来捡呀！", -- > 50%
                LOW = "吼呃~ 变身要结束了, 海狸需要食物", -- > 25%
                EMPTY = "呜吼, 伍迪饿饿饿饿饿饿饿饿饿饿饿饿啊~" -- < 25%
            }
        }
    },
    WALTER = {
		HUNGER = {
			FULL  = "松树先锋队员总是饱腹奔跑！", 	-- >75%
			HIGH  = "我应该为我们的下一次徒步旅行准备一份零食。",			-- >55%
			MID   = "我希望我在沃比里打包了一些零食...", 				-- >35%
			LOW   = "我希望我们能吃到更多！", 						-- >15%
			EMPTY = "别担心，姑娘，我们很快就会找到一些肮脏的东西！", 		-- <15%
		},
		SANITY = {
			FULL  = "我的先锋意识比以往任何时候都要好！", 	-- >75%
			HIGH  = "一个故事来缓解紧张气氛怎么样？", 	-- >55%
			MID   = "你也听到了吗 沃比？", 		-- >35%
			LOW   = "嘿，沃比，你看到了吗？！", 			-- >15%
			EMPTY = "我的故事中的怪物是真实存在的！", 	-- <15%
		},
		HEALTH = {
			FULL  = "这里没有瘀伤或蜜蜂叮蛰！", 					-- 100%
			HIGH  = "没有松树先锋无法处理的事情！",		 	-- >75%
			MID   = "我的急救培训即将派上用场！", -- >50%
			LOW   = "沃比应该把我带到安全的地方！", 					-- >25%
			EMPTY = "你可能还要继续，没有我的女孩...", 		-- <25%
		},
		WETNESS = {
			FULL  = "现在我浑身都是褶皱！",					 	-- >75%
			HIGH  = "有没有人记得打包毛巾？",		-- >55%
			MID   = "我所有的徽章都湿透了！", 				-- >35%
			LOW   = "只是一点水！", 					-- >15%
			EMPTY = "我经历过更糟糕的风暴！", 		-- <15%
		}
	},

    -- 顺手修改
    WORMWOOD = {
        HUNGER = {
            FULL = "养料充足, 茁壮生长！",
            HIGH = "树木丛生，百草丰茂。",
            MID = "努力吸收养分。",
            LOW = "阳光, 雨露, 浇水, 施肥。",
            EMPTY = "株枯木朽, 根叶萧疏！"
        },
        SANITY = {
            FULL = "碧玉妆成一树高，万条垂下绿丝绦。",
            HIGH = "庭中有奇树，绿叶发华滋。",
            MID = "桑之未落，其叶沃若。",
            LOW = "惟草木之零落兮，恐韶华之迟暮。",
            EMPTY = "落木萧萧！草木尽凋！"
        },
        HEALTH = {
            FULL = "枝繁叶茂！",
            HIGH = "嫩绿的叶片显得光亮！",
            MID = "城上草, 根不高, 风霜早。",
            LOW = "草木皆兵！",
            EMPTY = "木已成舟..."
        },
        WETNESS = {
            FULL = "真的真的湿了！",
            HIGH = "真的湿了！",
            MID = "夜来风雨声。",
            LOW = "下雨了！哦吼！",
            EMPTY = "小露珠！"
        }
    },

    -- 神话台词 by 小谢
    YANGJIAN = {
        HUNGER = {
            FULL = "辟谷之术，何需饮食。",
            HIGH = "我力诛八怪，各位想必听说过。",
            MID = "凡人食其物，仙人嗅其气。",
            LOW = "当返真君庙，受用香火。",
            EMPTY = "辟谷失术，不宜再战。"
        },
        SANITY = {
            FULL = "谦谦君子，温润如玉。",
            HIGH = "仪容清俊貌堂堂，两耳垂肩目有光。",
            MID = "似道非道，似俗非俗。",
            LOW = "母亲！舅舅竟这般无情。",
            EMPTY = "何方妖孽，乱吾心神！" -- 杨戬理智不会到这条。
        },
        HEALTH = {
            FULL = "修得八九玄中妙，任尔纵横在世间。",
            HIGH = "心高不认天家眷，性傲归神住灌江。",
            MID = "哮天犬，一起上吧！",
            LOW = "元神修在泥丸宫，肉身虽灭人不亡。",
            EMPTY = "梅山兄弟，速来助我！"
        },
        WETNESS = {
            FULL = "云清落雨，水澹生烟。", -- >75%
            HIGH = "昨夜观云不知意，今朝甘霖冷湿身！", -- >55%
            MID = "沾衣欲湿杏花雨。", -- >35%
            LOW = "何妨吟啸且徐行。", -- >15%
            EMPTY = "吹面不寒杨柳风。" -- <15%
        }
    },
    NEZA = {
        HUNGER = {
            FULL = "吃饱了，去东海耍耍？",
            HIGH = "我这力气不知拿不拿的动那金箍棒。",
            MID = "杀人不眨眼，吃人不放盐。",
            LOW = "吃点龙…猪肉吧！",
            EMPTY = "小爷我该回家吃饭了。"
        },
        SANITY = {
            FULL = "龙种自然非凡相，妙龄端不类凡尘。",
            HIGH = "天上麒麟子，烟霞彩凤仙。",
            MID = "神奇多敏悟，骨秀更清妍。",
            LOW = "李靖那厮，伤了我心。",
            EMPTY = "怎么，我三个头都疼了起来。"
        },
        HEALTH = {
            FULL = "身带六般神器械，飞腾变化广无边。",
            HIGH = "小妖怪们，我来找你们啦。",
            MID = "两眼是照妖镜，双腿是追风马。",
            LOW = "去他个鸟命！我命由我，不由天！",
            EMPTY = "若是有杨师兄相助就好了。"
        },
        WETNESS = {
            FULL = "梦回陈塘关。", -- >75%
            HIGH = "既是那老龙王能奈我何？", -- >55%
            MID = "带上混天绫去那河边痛快戏水去！", -- >35%
            LOW = "真是令人好兴致！", -- >15%
            EMPTY = "鱼戏莲叶东。" -- <15%
        }
    },
    MONKEY_KING = {
        HUNGER = {
            FULL = "俺可不像那呆子总想着吃。",
            HIGH = "可知俺的定海神针有多重。",
            MID = "蟠桃倒也中吃。",
            LOW = "孩儿们，为我备好宴席。",
            EMPTY = "师傅，我去化些斋饭。"
        },
        SANITY = {
            FULL = "身穿金甲亮堂堂，头戴金冠光映映。",
            HIGH = "叫俺美猴王！",
            MID = "一双怪眼似明星，两耳过肩查又硬。",
            LOW = "回想起困囚五行山。",
            EMPTY = "师傅莫要念那紧箍咒！"
        },
        HEALTH = {
            FULL = "你可知道你孙爷爷的手段。",
            HIGH = "上天入地,穿山过海,无所不至,无拘无束。",
            MID = "俺的金箍棒磕着就死，擦着就伤。",
            LOW = "我的本领？嗯…都是无师自通的。",
            EMPTY = "好妖精，倒有些手段。"
        },
        WETNESS = {
            FULL = "风雨雷电，真是讨打。", -- >75%
            HIGH = "水滚出去!", -- >55%
            MID = "该死的湿漉漉！", -- >35%
            LOW = "我的毛都湿了。", -- >15%
            EMPTY = "微风细雨，不知花果山变作怎样美景。" -- <15%
        }
    },
    MYTH_YUTU = {
        HUNGER = {
            FULL = "嫦娥姐姐，我吃饱了。",
            HIGH = "我有的是力气捣药。",
            MID = "吸残清露瑶天晓，捣药长生玉杵奇。",
            LOW = "我没想吃唐僧肉。",
            EMPTY = "我现在一口气能吃八百根大萝卜。"
        },
        SANITY = {
            FULL = "团身一块毛如玉，展足千山蹄若飞。",
            HIGH = "双睛红映，犹欺雪上点胭脂。",
            MID = "月有阴晴圆缺。",
            LOW = "月宫很美，也很孤寂。",
            EMPTY = "嫦娥姐姐，我好害怕！"
        },
        HEALTH = {
            FULL = "可以不用捣药了吗？玩去喽！",
            HIGH = "狡兔三窟，别想抓住我。",
            MID = "但愿人长久。",
            LOW = "打架别找我，去找那个金蟾。",
            EMPTY = "嘤, 我快要被打回原形了。"
        },
        WETNESS = {
            FULL = "这么湿滑，我还怎么蹦蹦跳跳。", -- >75%
            HIGH = "我现在是落汤兔，呜呜~", -- >55%
            MID = "兔子洞都快要被淹了。", -- >35%
            LOW = "我的毛都被打湿了。", -- >15%
            EMPTY = "微风吹拂着细雨，夹杂着泥土的芬芳！" -- <15%
        }
    },
    WHITE_BONE = {
        HUNGER = {
            FULL = "怕什么，我现在不想吃你。",
            HIGH = "人心血肉，甚是美味。",
            MID = "不知那唐三藏何时路过此地。",
            LOW = "不知那唐三藏何时路过此地。",
            EMPTY = "没有肉吃我便要吃队友！"
        },
        SANITY = {
            FULL = "待吾略施小计，唐僧手到擒来",
            HIGH = "化作美人，冰肌藏玉骨，衫领露酥胸",
            MID = "我怎觉三魂不稳，七魄不定？",
            LOW = "我怎觉三魂不稳，七魄不定？",
            EMPTY = "附近仿佛有其它妖气。"
        },
        HEALTH = {
            FULL = "千年尸魔成精，阴风化雾藏形。",
            HIGH = "小的们留守洞中，我自有妙计。",
            MID = "我有“解尸法”，遇险好逃脱。",
            LOW = "我有“解尸法”，遇险好逃脱。",
            EMPTY = "风卷孤芳落，魂去尸骨无。"
        },
        WETNESS = {
            FULL = "高于75%…完全湿身！", -- >75%
            HIGH = "55%…我湿透了，哇！背包好隔水，把我装进去吧！", -- >55%
            MID = "35%…我很湿！我去，背包也湿了！", -- >35%
            LOW = "15%…我只湿了一小块，还不足为惧！", -- >15%
            EMPTY = "我有一点点潮湿……" -- <15%
        }
    },
    PIGSY = {
        HUNGER = {
            FULL = "别问俺有没有吃饱，好吃的都拿出来。",
            HIGH = "总是七分饱，都忘了吃饱是什么滋味。",
            MID = "俺老猪的肚子早就饿扁了。",
            LOW = "俺老猪的肚子早就饿扁了。",
            EMPTY = "走不动了，实在是走不动了。"
        },
        SANITY = {
            FULL = "粗柳簸箕细柳斗，世上谁嫌男人丑。",
            HIGH = "丈母娘！若是取经不成，俺还会回来的。",
            MID = "你回你的流沙河，我回我的高老庄。",
            LOW = "你回你的流沙河，我回我的高老庄。",
            EMPTY = "明明是位女菩萨，偏说她是妖精。"
        },
        HEALTH = {
            FULL = "俺老猪是上界的天蓬元帅下凡。",
            HIGH = "就是九天荡魔祖师来了我也不惧。",
            MID = "俺老猪皮糙肉厚的，不好吃。",
            LOW = "俺老猪皮糙肉厚的，不好吃。",
            EMPTY = "猴哥！快来救我！"
        },
        WETNESS = {
            FULL = "高于75%…完全湿身！", -- >75%
            HIGH = "55%…我湿透了，哇！背包好隔水，把我装进去吧！", -- >55%
            MID = "35%…我很湿！我去，背包也湿了！", -- >35%
            LOW = "15%…我只湿了一小块，还不足为惧！", -- >15%
            EMPTY = "我有一点点潮湿……" -- <15%
        }
    },
    MADAMEWEB = {
        HUNGER = {
            FULL = "飞鸟尽，蛛网藏。",
            HIGH = "人家才不想一天到晚趴在蛛网上。",
            MID = "蝴蝶松饼、盐焗蜗牛、炖兔子……",
            LOW = "是时候收网了。",
            EMPTY = "是时候收网了。"
        },
        HEALTH = {
            FULL = "千丝盖天罗，万缕铺地网。",
            HIGH = "求我网开一面？休想。",
            MID = "请师兄为我报仇雪恨。",
            LOW = "请师兄为我报仇雪恨。",
            EMPTY = "孩儿们，各自逃命去吧。"
        },
        SANITY = {
            FULL = "汗沾粉面花含露，尘染蛾眉柳带烟。",
            HIGH = "似嫦娥临下界，仙子落凡尘。",
            MID = "怎么不见我那六个姐妹。",
            LOW = "怎么不见我那六个姐妹。",
            EMPTY = "若是潜心修行，何至如此。"
        },
        WETNESS = {
            FULL = "高于75%…完全湿身！", -- >75%
            HIGH = "55%…我湿透了，哇！背包好隔水，把我装进去吧！", -- >55%
            MID = "35%…我很湿！我去，背包也湿了！", -- >35%
            LOW = "15%…我只湿了一小块，还不足为惧！", -- >15%
            EMPTY = "我有一点点潮湿……" -- <15%
        }
    },

    -- 精灵公主 by 小鱼鱼
    MUSHA = {
        HUNGER = {
            FULL = "好饱呀~我真的一点都吃不下了",
            HIGH = "吃饱惹,我们去冒险吧！",
            MID = "小凤凰,你饿了吗我们去找吃的吧",
            LOW = "我真的好想吃美味的奶油苹果啊",
            EMPTY = "小凤凰看起来很好吃的样子，不行小凤凰是我的好朋友"
        },
        SANITY = {
            FULL = "不管在什么时候都要保持皇家的优雅~",
            HIGH = "没关系的小凤凰会陪着我",
            MID = "周围有点可怕的东西",
            LOW = "黑暗围绕在我身边",
            EMPTY = "小凤凰我好害怕呀"
        },
        HEALTH = {
            FULL = "Musha很强！能单挑全世界",
            HIGH = "小凤凰会和我并肩作战",
            MID = "我的笛子呢，音乐充满魔法可以治愈伤痕",
            LOW = "呜呜呜，好痛啊有人来帮帮我嘛",
            EMPTY = "快逃跑，躲起来！"
        },
        WETNESS = {
            FULL = "呜Musha湿透了，想要去换衣服", -- >75%
            HIGH = "全身湿哒哒的", -- >55%
            MID = "这好难弄干", -- >35%
            LOW = "我喜欢小凤凰在水里嘻嘻的样子", -- >15%
            EMPTY = "微风吹拂着细雨，夹杂着泥土的芬芳！" -- <15%
        },
        STAMINA = {
            FULL = "Musha有了力量就要干什么？教大家听话！", -- >75%
            HIGH = "我还不累我们继续冒险吧", -- >55%
            MID = "我有点累了，我想休息一下了", -- >35%
            LOW = "好困呀~感觉一闭眼就能睡着", -- >15%
            EMPTY = "我感觉意识都模糊了，我快要晕了" -- <15%
        },
        SPELLPOWER = {
            FULL = "风暴！火焰！大地！听从Musha的指挥！", -- >75%
            HIGH = "你惹错人惹！谁也别小看Musha", -- >55%
            MID = "我的魔力不足了，我想休息一下了", -- >35%
            LOW = "呜~魔力快要枯竭了", -- >15%
            EMPTY = "我的魔力护盾失效了，我真的一点魔力都没有了！" -- <15%
        }
    },

    -- 璇儿 by Geraint小白
    XUANER = {
        HUNGER = {
            FULL = "璇儿吃的可饱了呢！", -- 饱腹>75%
            HIGH = "师傅说，修行之人不可贪恋口舌之欲", -- >55%
            MID = "干饭人，干饭魂，璇儿要做人上人！干饭啦！", -- >35%
            LOW = "师傅不在，璇儿现在能吃下一整头牛", -- >15%
            EMPTY = "不给璇儿吃东西，璇儿就要饿死啦" -- <15%
        },
        SANITY = {
            FULL = "师傅说，修行之人切勿胡思乱想！", -- 脑残>75%
            HIGH = "遭了！璇儿要走火入魔啦！", -- >55%
            MID = "这是入魔的前兆吗？璇儿感觉不太好。", -- >35%
            LOW = "璇儿好像看见师傅了！", -- >15%
            EMPTY = "师傅，璇儿入魔了，快救救璇儿！" -- <15%
        },
        HEALTH = {
            FULL = "璇儿很健康也很强！", -- 血量100%
            HIGH = "一点小伤，不足畏惧！", -- >75%
            MID = "璇儿还能大战三百回合！", -- >50%
            LOW = "即使重伤，璇儿也绝不后退！", -- >25%
            EMPTY = "师傅，璇儿快不行了！" -- <25%
        },
        WETNESS = {
            FULL = "璇儿被淋成落汤鸡啦！", -- 潮湿值>75%
            HIGH = "璇儿湿透了，快找个地方避避雨吧", -- >55%
            MID = "可恶啊，这雨为何还不停！", -- >35%
            LOW = "待璇儿修行有成，区区小雨何足畏惧！", -- >15%
            EMPTY = "咦？似乎下雨了呢" -- <15%
        }
    },

    -- 小穹 by 果果
    SORA = {
        HUNGER = {
            FULL = "羊有跪乳之恩，鸦有反哺之义！", -- 饱腹>75%
            HIGH = "蒸羊羔，蒸熊掌，蒸鹿尾儿，烧花鸭.....", -- >55%
            MID = "御厨 御厨  宫中可有吃食？", -- >35%
            LOW = "食不言  寝不语", -- >15%
            EMPTY = "来人 上菜  大肉丸吧 " -- <15%
        },
        SANITY = {
            FULL = "昼短苦夜长，何不秉烛夜游？", -- 脑残>75%
            HIGH = "我们终将失去年少的自己！", -- >55%
            MID = "君之喜怒哀乐即吾之春夏秋冬！", -- >35%
            LOW = " 三里清风三里路，步步清风再无你 ！", -- >15%
            EMPTY = "寡人倍感爱之所失" -- <15%
        },
        HEALTH = {
            FULL = "果果小队，正在待命", -- 血量100%
            HIGH = "勇往直前，果果万岁！", -- >75%
            MID = "刀下生，刀下死", -- >50%
            LOW = "是时候重拳出击了！", -- >25%
            EMPTY = "我命由我不由天！" -- <25%
        },
        WETNESS = {
            FULL = "温泉？泳池？夏威夷？", -- 潮湿值>75%
            HIGH = "我的心好冷", -- >55%
            MID = "雨一直下，气氛不算融洽。。。", -- >35%
            LOW = "清泉幻化相思雨，惹得冰川泪几行！", -- >15%
            EMPTY = "雨静人心 静心听雨 夜雨养心" -- <15%
        }
    }

}
ANNOUNCE_STRINGS.__ = ANNOUNCE_STRINGS._
for k, v in pairs(ANNOUNCE_STRINGS) do
    if k ~= "_" and not  ANNOUNCE_STRINGS[k].BOAT then
        ANNOUNCE_STRINGS[k].BOAT = {
            FULL = "无敌战舰，启航！", -- >75%
            HIGH = "京口瓜洲一水间，钟山只隔数重山。", -- >55%
            MID = "江水沉沉帆影过，游鱼到晚透寒波。", -- >35%
            LOW = "或许我将葬身大海...", -- >15%
            EMPTY = "饥荒...海难!!!" -- <15%
        }
    end
end